let recipes = [ 
    {name:"Блины",
    ingredients:[   "Молоко", 
                    "Яйца",
                    "Масло растительное",
                    "Мука", 
                    "Сахар",
                    "Соль",
                    "Масло сливочное"
                ],
    time:10},

    {name:"Пельмени",
    ingredients:[   "Вода",
                    "Яйцо",
                    "Соль", 
                    "Масло",
                    "Мука",
                    "Фарш"
                ],
    time:5},

    {name:"Котлеты",
    ingredients:[   "Фарш", 
                    "Лук", 
                    "Картофель", 
                    "Хлеб", 
                    "Вода", 
                    "Соль"
                ],
    time:15},

    {name:"Борщ",
    ingredients:[   "Мясо", 
                    "Картофель", 
                    "Луковица", 
                    "Морковь", 
                    "Свекла",
                    "Капуста", 
                    "Чеснок",
                    "Томатная паста", 
                    "Вода"
                ],
    time:85},

    {name:"Солянка",
    ingredients:[   "Колбаса копченая", 
                    "Сосиски", 
                    "Говядина", 
                    "Лук",
                    "Огурцы", 
                    "Маслины",
                    "Томатная паста", 
                    "Масло",
                    "Вода"
                ],
    time:90},
     
    {name:"Картофельное пюре",
    ingredients:[   "Картофель", 
                    "Молоко", 
                    "Масло", 
                    "Соль"
                ],
    time:30},
]

function Finding(recipes, ingredient, SampledTime) {
   //этот цикл задает каждому объекту индекс
    for (let i = 0; i < recipes.length; i++) {
      //этот цикл смотрит если у нас допустим объект под индексом 0 и его пункт ingridients включает в себя (.includes) введеный ингредиент (SampledIngredient) и смотрит что объект под индексом 0 
      // имеет указанное в ключе время (recipes[0].time) меньше или равно введенному времени и указывает подходящее   
        if (recipes[i].ingredients.includes(ingredient) && recipes[i].time <= SampledTime) {
        console.log(recipes[i].name);
      }
      
    }
  }

  


  Finding(recipes, 'Вода', 2000)